# модель игры с ботом


def bot_go(mass0, k):
    '''в функцию подается массив - поле 9*9
и число к, которое дает понять, чем ходит бот.
если к=1, то бот ходит крестиками
если к=2, то бот ходит ноликами
бот делает ход в массиве mass0 и в нужную клетку ставит 1 или 2,
что соот крестику или нолику
потом возвращает новый массив с выполненным ходом'''
    '''чтобы лучше понять, как сделать эту функцию,
надо, вероятно, ознакомиться со всей программой.
Как-то так. кря-кря 128.'''
    pass


















