# тексты 
# нужно переделать переменные из строкового
# типа в тип записи текста в pygame

play_text = 'играть'
wall_text = 'правила'
wall_long_text = '' # надо написать правила игры
name_text = 'добро пожаловать в игру "гипер-крестики-нолики"'
back_text = 'назад'
play_one_text = 'играть с ботом'
play_two_text = 'играть вдвоём'
pobeda_cross_text = 'Победил первый игрок. Крестики торжествуют!'
pobeda_cross_text = 'Победил второй игрок. Нолики торжествуют!'
you_win_text = 'Поздравляю! Ты смог победить меня!'
you_lose_text = 'Как-нибудь в следующий раз тебе повезёт...'
your_play_text = 'Ваш ход. Вы ходите '+["крестиками" if not play_person else "ноликами"][0]
